SLNServiExpress/ServiExpress/Connected Services/LoginService/LoginService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://services/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="LoginService" targetNamespace="http://services/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="http://localhost:52552/LoginWebService/LoginService?xsd=1" namespace="http://services/" />
    </xsd:schema>
  </types>
  <message name="getRol">
    <part name="parameters" element="tns:getRol" />
  </message>
  <message name="getRolResponse">
    <part name="parameters" element="tns:getRolResponse" />
  </message>
  <message name="login">
    <part name="parameters" element="tns:login" />
  </message>
  <message name="loginResponse">
    <part name="parameters" element="tns:loginResponse" />
  </message>
  <portType name="LoginService">
    <operation name="getRol">
      <input wsam:Action="http://services/LoginService/getRolRequest" message="tns:getRol" />
      <output wsam:Action="http://services/LoginService/getRolResponse" message="tns:getRolResponse" />
    </operation>
    <operation name="login">
      <input wsam:Action="http://services/LoginService/loginRequest" message="tns:login" />
      <output wsam:Action="http://services/LoginService/loginResponse" message="tns:loginResponse" />
    </operation>
  </portType>
  <binding name="LoginServicePortBinding" type="tns:LoginService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="getRol">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
    <operation name="login">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="LoginService">
    <port name="LoginServicePort" binding="tns:LoginServicePortBinding">
      <soap:address location="http://localhost:52552/LoginWebService/LoginService" />
    </port>
  </service>
</definitions>